#include <string.h>
#include <iostream>
#include <stdlib.h>
#include <time.h>
#include <stdio.h>
#include "game.h"
using namespace std;


void player::opening()
{
	int c;

	cout << "------------------------" << "\n";
	cout << "｜　　　　            ｜" << "\n";
	cout << "｜    ＿__<i>_＿_　　 ｜" << "\n";
	cout << "｜  ／／／／＼＼＼　　｜" << "\n";
	cout << "｜ ＼（()〈〉()）／　 ｜" << "\n";
	cout << "｜ {i工8[i_!]8工i}　　｜" << "\n";
	cout << "｜　 ヽ(・ω・)ﾉ      ｜" << "\n";
	cout << "｜　　　　　　　　　　｜" << "\n";
	cout << "------------------------" << "\n\n";

	getchar();
	cout << "王：私はどっかの城の王じゃ。" << "\n";
	getchar();
	cout << "王：突然じゃが、そなたには魔王退治を頼みたい。" << "\n";
	getchar();
	cout << "王：引き受けてくれるかの？" << "\n";

	while(1){
		c = 0;
		cout << "はい：１ いいえ：２" << "\n";
		cin >> c;
		if(c == 1)
			break;
		else if(c == 2)
			cout << "王：まあ、そんなことを言わずに。" << "\n";
	}

	getchar();
	cout << "王：よくぞいってくれた。" << "\n";
	getchar();
	cout << "王：では勇者・・・。"  << "\n";
	getchar();
	cout << "王：・・・ところでおぬし、名はなんと申す？" << "\n";
	cout << "名前を入力してください。：";
	cin >> name;

	cout << "王：では勇者" << name << "魔王退治頼んだぞ。" << "\n";
	getchar();
	cout << "王：そうじゃおぬしにはこれをプレゼントしよう。" << "\n";
	getchar();
	cout << name << "は勇者の剣を手に入れた。" << "\n";
	getchar();
	cout << name << "は勇者の兜を手に入れた。" << "\n";
	getchar();
	cout << name << "は勇者の鎧を手に入れた。" << "\n";
	getchar();
	cout << name << "は王様からもらった装備をすべて身につけた。" << "\n";
	getchar();
	cout << "王：では行くがいい勇者" << name << "よ。" << "\n";
	getchar();
	cout << "こうして魔王を倒すため勇者" << name << "は旅をすることになった。" << "\n";
	getchar();
	cout << "王様の情報によると、魔王は森を越えたところにある城に住んでいるらしい。" << "\n";
	getchar();
	cout << "ようやく森にたどり着くと、奥からたくさんの魔物の気配がする。" << "\n";
	getchar();
	cout << "勇者" << name << "は、そのまま森を突き進むことにした。" <<"\n\n";
	getchar();

	return;
}

void player::battle()
{
	int c,r,r2,i;

	while(1){
		cout << "--------------------------------------------------------------" << "\n\n";
		cout << name << "：　Lv：" << lv << "　HP：" << hp << "　MP：" << mp << "\n\n";
		cout << "--------------------------------------------------------------" << "\n\n";
		srand(time(NULL));
		r = (rand() % 10) + 1;
		cout << "--------------------------------------------------------------" << "\n\n";
		for(i = 0;i < r;i++)
			cout << "(゜゜)";
		cout << "\n\n" <<"--------------------------------------------------------------" << "\n\n";
		cout << "敵が" << r << "体あらわれた。" << "\n";
		cout << "どうする？" << "\n";
		while(1){
			c = 0;
			cout << "たたかう：１" << "\n";
			cin >> c;
			if(c == 1)
				break;
		}
		srand(time(NULL));
		r2 = rand() % 5;
		cout << name << "は、" << r2 << "ダメージを受けた。" << "\n";
		hp = hp - r2;
		if(hp <= 0){
			hp = 0;
			return;
		}
		cout << "魔物の群れを倒した。" << "\n";
		cout << name << "のレベルが" << r << "上がった。" << "\n";
		lv = lv + r;
		if(lv >= 10)
			break;
	}


	cout << name << "は、「ヒール」を覚えた。" << "\n";
	getchar();
	cout << "「ヒール」はMPを20消費することでHPを全快させる魔法です。" << "\n";
	getchar();
	cout << name << "のMPが50に増えた。" << "\n";
	getchar();
	mp = 50;

	while(1){
		cout << "--------------------------------------------------------------" << "\n\n";
		cout << name << "：　Lv：" << lv << "　HP：" << hp << "　MP：" << mp << "\n\n";
		cout << "--------------------------------------------------------------" << "\n\n";
		srand(time(NULL));
		r = (rand() % 10) + 1;
		cout << "--------------------------------------------------------------" << "\n\n";
		for(i = 0;i < r;i++)
			cout << "(゜゜)";
		cout << "\n\n" <<"--------------------------------------------------------------" << "\n\n";
		cout << "敵が" << r << "体あらわれた。" << "\n";
		cout << "どうする？" << "\n";
		while(1){
			c = 0;
			cout << "たたかう：１　ヒール：２" << "\n";
			cin >> c;
			if(c == 1)
				break;
			else if(c == 2){
				if(mp >= 20){
					cout << name << "のHPが" << lv + 10 << "に回復した。" << "\n";
					hp = lv + 10;
					mp = mp - 20;
					cout << "--------------------------------------------------------------" << "\n\n";
					cout << name << "：　Lv：" << lv << "　HP：" << hp << "　MP：" << mp << "\n\n";
					cout << "--------------------------------------------------------------" << "\n\n";
				}else
					cout << "MPが足りない。" << "\n";
			}
		}
		srand(time(NULL));
		r2 = rand() % 10;
		cout << name << "は、" << r2 << "ダメージを受けた。" << "\n";
		hp = hp - r2;
		if(hp <= 0){
			hp = 0;
			return;
		}
		cout << "魔物の群れを倒した。" << "\n";
		cout << name << "のレベルが" << r << "上がった。" << "\n";
		lv = lv + r;
		if(lv >= 70)
			break;
	}

	cout << name << "は、「サンダー」を覚えた。" << "\n";
	getchar();
	cout << "「サンダー」はMPを50消費することで敵に向かって雷を落とす魔法です。" << "\n";
	getchar();
	cout << name << "のMPが100に増えた。" << "\n";
	mp = 100;
	getchar();

	while(1){
		cout << "--------------------------------------------------------------" << "\n\n";
		cout << name << "：　Lv：" << lv << "　HP：" << hp << "　MP：" << mp << "\n\n";
		cout << "--------------------------------------------------------------" << "\n\n";
		srand(time(NULL));
		r = (rand() % 10) + 1;
		cout << "--------------------------------------------------------------" << "\n\n";
		for(i = 0;i < r;i++)
			cout << "(゜゜)";
		cout << "\n\n" <<"--------------------------------------------------------------" << "\n\n";
		cout << "敵が" << r << "体あらわれた。" << "\n";
		cout << "どうする？" << "\n";
		srand(time(NULL));
		r2 = rand() % 20;
		while(1){
			c = 0;
			cout << "たたかう：１　ヒール：２　サンダー：３" << "\n";
			cin >> c;
			if(c == 1)
				break;
			else if(c == 2){
				if(mp >= 20){
					cout << name << "のHPが" << lv + 10 << "に回復した。" << "\n";
					hp = lv + 10;
					mp = mp - 20;
					cout << "--------------------------------------------------------------" << "\n\n";
					cout << name << "：　Lv：" << lv << "　HP：" << hp << "　MP：" << mp << "\n\n";
					cout << "--------------------------------------------------------------" << "\n\n";
				}else
					cout << "MPが足りない。" << "\n";
			}else if(c == 3){
				if(mp >= 50){
					cout << "なんと！森全体に雷が降り注いだ！" << "\n";
					r = rand() % 100;
					r2 = 0;
					cout << r << "体の魔物が雷に巻き込まれた。" << "\n";
					mp = mp - 50;
					break;
				}else
					cout << "MPが足りない。" << "\n";
			}
		}
		cout << name << "は、" << r2 << "ダメージを受けた。" << "\n";
		hp = hp - r2;
		if(hp <= 0){
			hp = 0;
			return;
		}
		cout << "魔物の群れを倒した。" << "\n";
		cout << name << "のレベルが" << r << "上がった。" << "\n";
		lv = lv + r;
		if(lv >= 100)
			break;
	}

	return;
}


void player::ending()
{
	int c;
	cout << "魔王は、勇者" << name << "によって倒された。" << "\n";
	getchar();
	cout  << "そして、" << name << "は、城に帰っていった。" << "\n";
	getchar();

	cout << "------------------------" << "\n";
	cout << "｜　　　　            ｜" << "\n";
	cout << "｜    ＿__<i>_＿_　　 ｜" << "\n";
	cout << "｜  ／／／／＼＼＼　　｜" << "\n";
	cout << "｜ ＼（()〈〉()）／　 ｜" << "\n";
	cout << "｜ {i工8[i_!]8工i}　　｜" << "\n";
	cout << "｜　 ヽ(・ω・)ﾉ      ｜" << "\n";
	cout << "｜　　　　　　　　　　｜" << "\n";
	cout << "------------------------" << "\n\n";

	cout << "王：よくぞ魔王を倒してくれた。" << "\n";
	getchar();
	cout << "王：礼を言うぞ" << name << "。" << "\n";
	getchar();
	cout << "王：それはそうと、おぬしはそろそろ現実の世界に帰る時間ではないのか？" << "\n";
	getchar();
	cout << "王：安心なさい現実世界へは私が送り届けよう。" << "\n";
	getchar();
	cout << "王：では、さらばじゃ・・・。" << "\n";
	getchar();
	cout << "GAME CLEAR!!" << "\n";
	getchar();
	cout << "お疲れ様でした。「1」を押して「Enter」キーを押してこのプログラムを停止してください。" << "\n";

	while(1){
		c = 0;
		cin >> c;
		if(c == 1)
			return;
	}

	return;
}

void player::gameover()
{
	int c;
	cout << "GAME OVER" << "\n";
	getchar();
	cout << name << "は、力尽きてしまった。" << "\n";
	getchar();
	cout << "終了する：１" << "\n";

	while(1){
		c = 0;
		cin >> c;
		if(c == 1)
			return;
	}

	return;

}
